In [2]:
import pandas as pd
import numpy as np

In [3]:
x=pd.Series([2.1,2.3,4.5,2.2,2.4])

m=np.median(x)
th=2
ol=[]
for i in x:
    if abs(i-m)>th:
        ol.append(i)
print(ol)

[4.5]

In [4]:
x=pd.Series([2.1,2.3,4.5,2.2,2.4])

mean=np.mean(x)
std=np.std(x)
ol=[]
for i in x:
    if (i< mean-std) or (i> mean+std):
        ol.append(i)
print(ol)

[4.5]

In [5]:
x=pd.Series([2.1,2.3,4.5,2.2,2.4])

mean=np.mean(x)
std=np.std(x)
ol=[]
for i in x:
    z=(i-mean)/std
    if z>1.5:
        ol.append(i)
print(ol)

[4.5]

In [6]:
print(mean)

2.7

In [7]:
x=pd.Series([2.1,2.3,4.5,2.2,2.4])
Q1,Q3=np.percentile(x,[25,75])
IQR=Q3-Q1
ol=[]
for i in x:
    if i<(Q1- 1.5*IQR) or i>(Q3+ 1.5*IQR):
        ol.append(i)
print(ol)

[4.5]

In [9]:
from numpy import NaN

In [11]:
d1={ 'Name' : ['Lokesh', 'Abhishek', 'Viany', 'Prem'], 'Age'  : [28,27,NaN,36]}
d=pd.DataFrame.from_dict(d1)
d

       Name   Age
0    Lokesh  28.0
1  Abhishek  27.0
2     Viany   NaN
3      Prem  36.0

In [12]:
d.isnull()

    Name    Age
0  False  False
1  False  False
2  False   True
3  False  False

In [13]:
d.isnull().sum()

Name    0
Age     1
dtype: int64

In [14]:
d.dropna(inplace=True)
d

       Name   Age
0    Lokesh  28.0
1  Abhishek  27.0
3      Prem  36.0

In [15]:
d1={ 'Name' : ['Lokesh', 'Abhishek', 'Viany', 'Prem'], 'Age'  : [28,27,NaN,36]}
d=pd.DataFrame.from_dict(d1)
d

       Name   Age
0    Lokesh  28.0
1  Abhishek  27.0
2     Viany   NaN
3      Prem  36.0

In [23]:
d['Age'].fillna(d['Age'].mean(), inplace=True)
d

       Name        Age
0    Lokesh  28.000000
1  Abhishek  27.000000
2     Viany  30.333333
3      Prem  36.000000

In [24]:
import re

In [25]:
txt ='Python is my favorite programming language. I love Python.'
x=re.findall('Python', txt)
x

['Python', 'Python']

In [26]:
len(x)

2

In [27]:
x='Python is my favorite programming language.'
re.findall('^Python',x)

['Python']

In [28]:
y='I love Python.'
re.findall('^Python',y)

[]

In [30]:
txt='Pthon was released in 1991.'
re.findall('\d', txt)

['1', '9', '9', '1']

In [31]:
txt='Pthon was released in 1991.'
re.findall('\d+', txt)

['1991']

In [32]:
l=['INDIA','NEPAL','BHUTAN','INDIA']
t=pd.Series(l)
t

0     INDIA
1     NEPAL
2    BHUTAN
3     INDIA
dtype: object

In [34]:
re.findall('INDIA', t.to_string())

['INDIA', 'INDIA']

In [35]:
txt='Hello World'
mo=re.search('World', txt)
mo

In [36]:
mo.span()

(6, 11)

In [38]:
txt='C is my favorite programming language'
re.sub(pattern='C', repl='Python', string=txt)

'Python is my favorite programming language'

In [39]:
dict={ 'Age' :[28,27,30,36,27],'Salary':[10000,15000,11000,11000,13000]}
d=pd.DataFrame.from_dict(dict)
d

   Age  Salary
0   28   10000
1   27   15000
2   30   11000
3   36   11000
4   27   13000

In [40]:
d=(d-d.min())/(d.max()-d.min())
d

        Age  Salary
0  0.111111     0.0
1  0.000000     1.0
2  0.333333     0.2
3  1.000000     0.2
4  0.000000     0.6

In [41]:
dict={ 'Age' :[28,27,30,36,27],'Salary':[10000,15000,11000,11000,13000]}
d=pd.DataFrame.from_dict(dict)
d

   Age  Salary
0   28   10000
1   27   15000
2   30   11000
3   36   11000
4   27   13000

In [42]:
d=(d-d.mean())/d.std()
d

        Age  Salary
0 -0.423109    -1.0
1 -0.687552     1.5
2  0.105777    -0.5
3  1.692435    -0.5
4 -0.687552     0.5